---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.ElectricalSystem
source: html/4ed4bd8e-8335-306e-a1e4-d61431d6792a.htm
---
# ElectricalSystem Methods

Add elements into the system and connect them with the system using given connectors.